УТ_для_edt/src/Catalogs/смартДЛ_ВидыУпаковок/смартДЛ_ВидыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартДЛ_ВидыУпаковок</name>
  <attributes>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МожноЗаказатьНесколько</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Несовместимость</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартДЛ_ВидыУпаковок/ManagerModule.bsl
Функция ПолучитьМассивПоляПоиска() Экспорт 
	
	Возврат смартДеловыеЛинии.МассивДвухЭлементов("uid", "UID");
	
КонецФункции  

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = смартДеловыеЛинии.НоваяТаблицаПолейЗначений();
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "title", "Наименование", "Реквизит"); 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "УсловноеНаименование", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "countable", "МожноЗаказатьНесколько", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "incompatible", "Несовместимость", "ТабличнаяЧасть", Новый Структура("UID", Неопределено));	
	
	Возврат Результат;
	
КонецФункции
